import React from 'react';
import { routes } from 'Helpers/Constants/routes';
import { Link, useNavigate } from 'react-router-dom';
import style from './PostsList.module.scss';

export const PostText4 = () => {
  const navigate = useNavigate();
  return (
    <main className={style.wrapper}>
      <h1>Как выбрать котенка</h1>
      <p>
        Вы планируете завести в доме кошку? Это правильная идея! Но не торопитесь. Во-первых,
        никогда не принимайте спонтанного решения, увидев хорошенького котенка в переходе метро, или
        соблазнившись уговорами коллеги по работе, пристраивающей котят от своей кошки. А во-вторых,
        спросите себя вначале, а для чего вам кошка? От этого, собственно, и зависит дальнейший план
        ваших действий. Хотите заниматься разведением? В таком случае, хорошо подумайте, сможете ли
        вы участвовать со своим питомцем в многочисленных выставках, хватит ли у вас свободного
        времени, да и сил заниматься этим очень интересным, увлекательным (для многих это становится
        делом всей их жизни) занятием. Позволят ли ваши жилищные условия принимать «невест» для
        своего кота, ну а в случае, если у вас кошка,- содержать котят, пока их не заберут новые
        хозяева. Сможете ли обеспечить ВСЕМ вашим котятам должный уход, найти ВСЕМ им новый дом!
        Если у вас по какой-либо причине не заберут котенка, вам придется брать ответственность за
        его жизнь на себя и растить нового члена семьи… И если от каждого помета, будет оставаться
        хотя бы по котенку, то в вашем доме скоро будет очень-очень весело. Готовы? Тогда - вперед!
        Походите на выставки, пообщайтесь с хозяевами выставляемых кошек. Почитайте литературу про
        выставочные классы, про правила участия кошек и котов в выставках и, если вас это
        по-прежнему не пугает и вы готовы - дерзайте. Но! Не забывайте, пожалуйста, об одной
        проблемке - если вы взяли кошку, увлеклись разведением, даже завели потомство, а потом вдруг
        резко ко всему этому охладели, здесь еще пока нет ничего страшного (естественно, мы считаем,
        что котята уже выращены и отданы хорошим людям). Кошку можно стерилизовать после родов. Даже
        среди многих ветеринаров бытует мнение, что кошке полезно дать один раз родить. И, что самое
        замечательное, - ко всем ее достоинствам прибавится еще одно - она перестанет периодически
        требовать кота. Но а если у вас кот…С котом сложнее. «Попробовав» один раз, конечно же, - он
        захочет больше и больше, вы обязаны будете поставлять ему кошек, чтобы он не безобразничал
        дома. Зов природы.. еще ни один кот не смог ему противостоять. Кастрировать кота, который
        был уже «женат», конечно, можно и даже есть шанс, что вам повезет, и он станет примерным и
        дисциплинированным котиком. Но этот шанс - очень небольшой, увы. Коты, кастрированные после
        того, как они стали папами, скорее всего, будут продолжать метить, кричать и делать все то,
        что делали до кастрации. С одной только разницей – не будет такого запаха после меток… и
        котят не будет…. Так что…Думайте сами, решайте сами. Решение всегда за вами, не
        уподобляйтесь только некоторым хозяевам, которые берут кошек в дом, не подумав заранее о
        кастрации, и предоставляют кошкам рожать столько, сколько ей вздумается, до полного ее
        истощения, а коту позволяют гулять, где ему захочется, подвергая себя риску быть
        искалеченным или убитым. Вы же не хотите такой судьбы для своей кошки? И - обязательно
        помните, кошек нужно любить! Не берите в дом кошку в угоду воспитания ребенка (чтоб рос
        заботливым), в подарок бабушке (чтоб не скучно было) или еще для чего-то там и чем-то там
        оправдывая появление кошки в дом. Кошка - не аквариумная рыбка!!! Эти удивительные существа
        обладают магической силой и возможностью. Доказано, что они могут общаться с человеком на
        уровне телепатии. А также обладают способностью вылечивать различные заболевания и даже
        могут умереть, приняв на себя болезни родного человека. Но! Кошка НИКОГДА не будет делиться
        своими уникальными способностями с тем, кто ее не любит и кого она не любит сама! Вот
        так-то. Если кошка для вас - нечто вроде мебели, она будет с вами жить, будет подчиняться
        тому порядку, который есть у вас, но вы даже не поймете и по-настоящему не узнаете, что же
        это такое - кошка… А зачем тогда вам это нужно? Итак. Вы решили взять в дом котенка. Вы
        прошли все стадии мучительных раздумий - для чего, какую породу, какой окрас, какой пол, и
        даже уже присмотрели себе котенка. Котенку должно уже быть не меньше двух месяцев, прежде
        чем вы заберете его от мамы. Не обязательно котенок должен быть породистым (даже, если
        берете для выставок, беспородных тоже можно выставлять), хотя мое личное мнение -
        беспородных кошек не бывает! И любой, казалось бы, самый невзрачный котенок может стать
        вашим личным ангелом-хранителем до конца его дней. Но вот - вы пришли «на смотрины». Пять и
        больше котят. Такие все милые. Как выбрать? Надеюсь, по внешним признакам отличить больного
        котенка от здорового, вы уже можете? Понятно, что никаких выделений из глаз, ушей, попа
        чистая, глазки ясные, в квартире убрано, запаха нет, из лотков, пардон, не воняет. Так что,
        - здесь вы уже спецы и все знаете. А вот характер как же, как же понять - мой, не мой? В
        одной из книг я как-то прочитала, что котенка нужно выбирать самого шустрого, боевого,
        игривого, и не берите, было написано в этой книге,– спокойного, флегматичного, он «может
        быть застенчив»! Вот те раз! А чем плох «застенчивый» кот? Вот Рыжий у меня застенчив. И
        что? Я его люблю как-то меньше? А может, я не хочу иметь дома реактивный двигатель по
        шкафо-стено-шторно-потолочным поверхностям! Может меня как раз устраивает
        тактично-деликатное поведение моего кота? Еще один способ, который широко описан в книгах по
        выбору щеночков и котят, это следующий: «берите того, который к вам САМ подошел»!
        Замечательный способ, надо заметить. Почему-то, со мной всегда происходила одна и та же
        история, что при выборе щенка, что при выборе котенка - ко мне подходили ДВОЕ! Я терялась. Я
        не знала, кому отдать предпочтение. В итоге, когда выбор был окончательно сделан, но
        все-равно «червячок точил»- а того ли я выбрала? А тот второй, а может он был для меня? На
        самом деле - никогда не сомневайтесь, если для выставок берете,- лучше возьмите с собой
        эксперта, а если для себя - слушайте только свое сердце, оно не обманет. Вот так просто - к
        кому душа потянулась, - тот ваш. И никогда не возвращайтесь мыслями к прошлому (это, кстати,
        всего касается), ваш выбор УЖЕ сделан! Ничего в этой жизни не происходит просто так. Если
        взяли именно этого, значит это кому-то нужно… Выбрали, не забудьте попросить у хозяйки
        вместе с котенком немного наполнителя (грязного) с собой. Вам будет легче, приехав домой,
        высыпать привезенное с собой, в свой чистый наполнитель и показать котенку, где его туалет.
        Понимают с ходу. Проблем не было ни разу. Кормить котенка нужно не менее чем пять раз в
        день. Можно чаще, если позволяют возможности. Главное - не перекармливать. В первые дни
        продолжайте кормить котенка тем же, чем кормили его хозяева мамы-кошки. Нельзя резко менять
        рацион. Потом можете добавлять что-то свое, что покажется вам наиболее лучшим, удобным,
        полезным. Рационов для кормления молодого кошачьего поколения - достаточно много. С кормом
        надо тоже определиться заранее. Мое личное мнение - котенка лучше всего, хотя бы до месяцев
        десяти, кормить преимущественно натуральной пищей, обязательно мясом: говядину,
        перемораживать не менее чем 50 часов в морозилке, потереть на крупной терке или поскоблить
        ножом, оттаять и согреть до комнатной температуры (можно и подогреть в микроволновочке чуток
        совсем - не перегревать!) и дать котенку. Никогда не давайте парного мяса, не вредите своему
        питомцу!!! Котенку надо давать творог (очень хороший, есть такой для деток –Агуша, котята
        его с удовольствием уплетают), яичные желтки (лучше желтки и лучше перепелиные раз-два в
        неделю), кефир нежирный, редко- морскую отварную рыбу, различные субпродукты (не увлекаться
        ни в коем случае, только как дополнение к мясу!), овсяные хлопья: я заливала одну столовую
        ложку кипятком и ставила в микроволновку на одну минуту и-все!, пока кашка немного остывала,
        заодно и заваривалась. Смешивала хлопья с мясом или вареной курочкой, так вкуснее и уходила
        на ура. Овощи - морковку, свеклу, кабачки. Здесь надо понимать что морковь, например, может
        дать ненужную вам рыжину в окрасе вашего питомца (как случилось с нашим старшеньким после
        кормления его морковкой, и его серебристо-голубой окрас местами превратился в
        коричневато-желтый). Для здоровья это не вредно, а вот, если на выставку, то вы
        понимаете…Баклажаны нельзя категорически, помидоры, картофель исключить тоже. Натуральная
        пища - это самая идеальная еда для кошек. Мясо только надо покупать из проверенных
        источников, а с этим у нас сейчас большие сложности, увы. Если в будущем хотите перевести
        котенка на сухой корм, насыпайте немного в мисочку на ночь, - пусть хрустит себе. Для зубок
        полезно. Витамины. Про них столько споров сейчас, давать, не давать. Кто кричит, что без
        витаминов котенок вырастет чахлым, хилым и рахитичным. Кто уверяет, что витамины кошкам
        давать не стоит в принципе, они сами у них вырабатываются, кроме таурина, разве что. Во всем
        нужна мера. Попадались мне такие упаковки с витаминами, где суточная норма чудо-витаминок
        доходила до 20-30 штук в день. Не выполняйте такие инструкции. И вообще не доверяйте слепо
        никому. Если у вас есть знакомый ветеринар - вам и вашим животным очень повезло, а если нет
        - выбирайте хорошую клинику, читайте отзывы, ездите, знакомьтесь, вам обязательно повезет и
        вы найдете «своего» врача. Здесь все как у людей,- если вы не имеете никакого отношения к
        медицинским работником и ваша лучшая подруга - не врач, то…. вам лучше не болеть. У котенка
        должен быть приготовлен лоток, посуда (лучше стеклянная или керамическая), свой уголок в
        доме. Кошачьим уголком в доме может быть все, что угодно: специальный кошачий лежачок,
        старое кресло, коробка из-под чего-либо, достаточно вместительная и удобная. Главное, чтоб
        этот самый уголок не был расположен на проходном месте. Уголок - на то и уголок. Если
        позволяет место в квартире, то кошачий домик,- это идеальное приобретение для подрастающего
        которебенка. Только с выбором домика лучше не затягивать, бывают случаи, когда взрослая
        кошка напрочь отказывалась пользоваться долгожданным приобретением их хозяев. Самая лучшая
        игрушка для котенка - это скомканная бумажка на веревочке. Играйте с которебенком чаще. Моим
        котам из всех игрушек никогда не надоедает играть в «шуршащем туннеле», - обожают
        проноситься в нем друг за дружкой со скоростью пули. Купите, - не пожалеете. Он не дорого
        стоит. Когда мой старшенький был еще маленьким, он отважно защищал от меня свой туннель,
        даже махал на меня лапой, не давая мне его трогать и стирать. До сих пор его сторожит.
        Сейчас, конечно, снисходительно относится к тому, что я периодически протираю ЕГО вещь от
        пыли. Если забираю на постирушки, тогда караулит, чтоб далеко не унесла. Он такой…
        хозяйственный. И собственник страшный. А игрушечные мышки, шарики на веревочке, мячики и
        прочее, прочее…это все на один-два дня, не более.. не захламляйте – купите всего по одному,
        если так уж хочется - этого будет вполне достаточно. Ну и пара слов по воспитанию.. НИКОГДА
        не бейте кошек! Это также глупо, как и бесполезно. Кроме страха по отношению к вам - ничего
        вы не добьетесь. А нам нужна кошачья любовь….мы же помним… Кошки - они те же дети. Если
        ребенок ваш хулиганит, дерется, вредничает, вы в любом случае будете стараться из всех сил,
        чтобы на словах объяснить любимому чаду, что так делать нельзя. Но даже, если вы в сердцах
        шлепните свое чадо по мягкому месту, чадо разревется, но в итоге особенно страшного ничего
        не случится, кроме, может, ваших угрызений совести, а до ребенка (человеческого) таки
        дойдет, что мама рассердилась и может, в случае чего, опять сделать «ата-та-та». С кошкой
        такая ерунда не проходит, но я вас уверяю- с ней понадобится намного меньше терпения, чтобы
        она поняла, что так делать нельзя!!! Для этого иногда достаточно просто повысить голос. Или
        погрозить пальцем. Или не сильно хлопнуть в ладоши. Когда у меня был кот ангорской породы,
        он практически ничего не слышал, у белоснежных, да еще и разноглазых такое случается. Так он
        учился понимать по жестам!!! И для него «пригрозить пальчиком» было то же самое, что громко
        сказанное «Нельзя». У нас с ним был выработан некий язык жестов. Он свое имя, не поверите, -
        читал по губам! То есть позвать его, находясь в другой комнате, было невозможно, он не
        слышал. Но, если он меня видел, он, глядя мне прямо в лицо, «считывал», что я говорю и как
        только я произносила его имя, - срывался с места. А может и телепатически мы с ним
        обменивались информацией. Потому как было, было… было такое, что стоило мне о нем подумать,
        вот не пора ли позвать кота кушать, так он тут же и нарисовывался, как будто услышал… Но
        тогда я очень мало знала о кошках и не особо придавала этому значения. А жаль. Так что,
        кошки, - они удивительные. Тот, кто их полюбит, - никогда не пожалеет что рядом с ним, в его
        жизни, появилось это загадочное, неповторимое, мистическое и пока никем не объяснимое
        существо - КОШКА....
      </p>
      <Link to={routes.posts}>go to posts</Link>
      <button type="button" onClick={() => navigate(-1)}>
        предыдущий пост
      </button>
      <button type="button" onClick={() => navigate(1)}>
        следующий пост
      </button>
    </main>
  );
};
